{
    "description": "Dragos has identified a new activity group targeting access operations in the electric utility sector. We call this activity group RASPITE.  Analysis of RASPITE tactics, techniques, and procedures (TTPs) indicate the group has been active in some form since early- to mid-2017. RASPITE targeting includes entities in the US, Middle East, Europe, and East Asia. Operations against electric utility organizations appear limited to the US at this time.  RASPITE leverages strategic website compromise to gain initial access to target networks. RASPITE uses the same methodology as DYMALLOY and ALLANITE in embedding a link to a resource to prompt an SMB connection, from which it harvests Windows credentials. The group then deploys install scripts for a malicious service to beacon back to RASPITE-controlled infrastructure, allowing the adversary to remotely access the victim machine.",
    "meta": {
        "refs": [
            "https://dragos.com/blog/20180802Raspite.html",
            "https://symantec-blogs.broadcom.com/blogs/threat-intelligence/leafminer-espionage-middle-east",
            "https://attack.mitre.org/groups/G0077/"
        ],
        "since": "2017",
        "synonyms": [
            "LeafMiner",
            "Raspite"
        ],
        "targeted-sector": [
            "Electric"
        ],
        "victimology": "Electric utility sector"
    },
    "uuid": "2c8994ba-367c-46f6-bfb0-390c8760dd9e",
    "value": "RASPITE",
    "mitre_attack_ids": [
        "intrusion-set--32bca8ff-d900-4877-aa65-d70baa041b74"
    ],
    "mitre_attack_urls": [
        "https://attack.mitre.org/groups/G0077",
        "https://www.dragos.com/blog/20180802Raspite.html",
        "https://www.symantec.com/blogs/threat-intelligence/leafminer-espionage-middle-east"
    ],
    "mitre_description": "[Leafminer](https://attack.mitre.org/groups/G0077) is an Iranian threat group that has targeted government organizations and business entities in the Middle East since at least early 2017. (Citation: Symantec Leafminer July 2018)",
    "mitre_aliases": [
        "Leafminer",
        "Raspite"
    ],
    "mitre_contributors": [],
    "mitre_created": "2018-10-17T00:14:20.652Z",
    "mitre_modified": "2023-03-22T04:50:51.782Z"
}