{
    "description": "Likely Chinese state-sponsored threat activity group RedDelta targeting organizations within Europe and Southeast Asia using a customized variant of the PlugX backdoor. Since at least 2019, RedDelta has been consistently active within Southeast Asia, particularly in Myanmar and Vietnam, but has also routinely adapted its targeting in response to global geopolitical events. This is historically evident through the group’s targeting of the Vatican and other Catholic organizations in the lead-up to 2021 talks between Chinese Communist Party (CCP) and Vatican officials, as well as throughout 2022 through the group’s shift towards increased targeting of European government and diplomatic entities following Russia’s invasion of Ukraine.\n\nDuring the 3-month period from September through November 2022, RedDelta has regularly used an infection chain employing malicious shortcut (LNK) files, which trigger a dynamic-link library (DLL) search-order-hijacking execution chain to load consistently updated PlugX versions. Throughout this period, the group repeatedly employed decoy documents specific to government and migration policy within Europe. Of note, we identified a European government department focused on trade communicating with RedDelta command-and-control (C2) infrastructure in early August 2022. This activity commenced on the same day that a RedDelta PlugX sample using this C2 infrastructure and featuring an EU trade-themed decoy document surfaced on public malware repositories. We also identified additional probable victim entities within Myanmar and Vietnam regularly communicating with RedDelta C2 infrastructure.\n\nRedDelta closely overlaps with public industry reporting under the aliases BRONZE PRESIDENT, Mustang Panda, TA416, Red Lich, and HoneyMyte.",
    "meta": {
        "refs": [
            "https://go.recordedfuture.com/hubfs/reports/cta-2022-1223.pdf"
        ]
    },
    "related": [
        {
            "dest-uuid": "78bf726c-a9e6-11e8-9e43-77249a2f7339",
            "tags": [
                "estimative-language:likelihood-probability=\"likely\""
            ],
            "type": "overlaps"
        },
        {
            "dest-uuid": "420ac20b-f2b9-42b8-aa1a-6d4b72895ca4",
            "tags": [
                "estimative-language:likelihood-probability=\"likely\""
            ],
            "type": "overlaps"
        }
    ],
    "uuid": "fceed509-938e-4f9e-acd4-76e6c28dc6f1",
    "value": "RedDelta"
}