{
    "description": "Proofpoint researchers detected campaigns from a relatively new actor, tracked internally as TA2101, targeting German companies and organizations to deliver and install backdoor malware. The actor initiated their campaigns impersonating the Bundeszentralamt fur Steuern, the German Federal Ministry of Finance, with lookalike domains, verbiage, and stolen branding in the emails. For their campaigns in Germany, the actor chose Cobalt Strike, a commercially licensed software tool that is generally used for penetration testing and emulates the type of backdoor framework used by Metasploit, a similar penetration testing tool. Proofpoint researchers have also observed this actor distributing Maze ransomware, employing similar social engineering techniques to those it uses for Cobalt Strike, while also targeting organizations in Italy and impersonating the Agenzia Delle Entrate, the Italian Revenue Agency. We have also recently observed the actor targeting organizations in the United States using the IcedID banking Trojan while impersonating the United States Postal Service (USPS).",
    "meta": {
        "country": "RU",
        "refs": [
            "https://www.proofpoint.com/us/threat-insight/post/ta2101-plays-government-imposter-distribute-malware-german-italian-and-us",
            "https://www.crowdstrike.com/blog/double-trouble-ransomware-data-leak-extortion-part-1/",
            "https://adversary.crowdstrike.com/adversary/twisted-spider/",
            "https://analyst1.com/file-assets/RANSOM-MAFIA-ANALYSIS-OF-THE-WORLD%E2%80%99S-FIRST-RANSOMWARE-CARTEL.pdf",
            "https://www.secureworks.com/blog/how-cyber-adversaries-are-adapting-to-exploit-the-global-pandemic",
            "http://www.secureworks.com/research/threat-profiles/gold-village",
            "https://www.cysecurity.news/2023/12/twisted-spiders-dangerous-cactus.html"
        ],
        "synonyms": [
            "Maze Team",
            "TWISTED SPIDER",
            "GOLD VILLAGE",
            "Storm-0216",
            "DEV-0216",
            "Twisted Spider"
        ]
    },
    "uuid": "39925aa0-c7bf-4b9b-97d6-7d600329453d",
    "value": "TA2101"
}