{
    "description": "As a part of our Kaspersky APT Intelligence Reporting subscription, customers received an update in mid-February 2017 on some interesting APT activity that we called WhiteBear. Much of the contents of that report are reproduced here. WhiteBear is a parallel project or second stage of the Skipper Turla cluster of activity documented in another private intelligence report “Skipper Turla – the White Atlas framework” from mid-2016. Like previous Turla activity, WhiteBear leverages compromised websites and hijacked satellite connections for command and control (C2) infrastructure. As a matter of fact, WhiteBear infrastructure has overlap with other Turla campaigns, like those deploying Kopiluwak, as documented in “KopiLuwak – A New JavaScript Payload from Turla” in December 2016. WhiteBear infected systems maintained a dropper (which was typically signed) as well as a complex malicious platform which was always preceded by WhiteAtlas module deployment attempts. However, despite the similarities to previous Turla campaigns, we believe that WhiteBear is a distinct project with a separate focus. We note that this observation of delineated target focus, tooling, and project context is an interesting one that also can be repeated across broadly labeled Turla and Sofacy activity.\nFrom February to September 2016, WhiteBear activity was narrowly focused on embassies and consular operations around the world. All of these early WhiteBear targets were related to embassies and diplomatic/foreign affair organizations. Continued WhiteBear activity later shifted to include defense-related organizations into June 2017. When compared to WhiteAtlas infections, WhiteBear deployments are relatively rare and represent a departure from the broader Skipper Turla target set. Additionally, a comparison of the WhiteAtlas framework to WhiteBear components indicates that the malware is the product of separate development efforts. WhiteBear infections appear to be preceded by a condensed spearphishing dropper, lack Firefox extension installer payloads, and contain several new components signed with a new code signing digital certificate, unlike WhiteAtlas incidents and modules.",
    "meta": {
        "attribution-confidence": "50",
        "cfr-suspected-state-sponsor": "Russian Federation",
        "cfr-suspected-victims": [
            "United States",
            "South Korea",
            "United Kingdom",
            "Uzbekistan"
        ],
        "cfr-target-category": [
            "Government",
            "Private sector"
        ],
        "cfr-type-of-incident": "Espionage",
        "country": "RU",
        "refs": [
            "https://securelist.com/introducing-whitebear/81638/",
            "https://www.cfr.org/interactive/cyber-operations/whitebear"
        ],
        "synonyms": [
            "Skipper Turla"
        ]
    },
    "uuid": "dc6c6cbc-9dc6-4ace-a2d2-fadefe45cce6",
    "value": "White Bear"
}